            Model 3(Cropping top 50 pixels and bottom 20 pixels)
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
cropping2d_1 (Cropping2D)    (None, 90, 320, 3)        0
_________________________________________________________________
lambda_1 (Lambda)            (None, 90, 320, 3)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 86, 316, 3)        228
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 43, 158, 3)        0
_________________________________________________________________
activation_1 (Activation)    (None, 43, 158, 3)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 39, 154, 24)       1824
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 20, 77, 24)        0
_________________________________________________________________
activation_2 (Activation)    (None, 20, 77, 24)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 73, 36)        21636
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 8, 37, 36)         0
_________________________________________________________________
activation_3 (Activation)    (None, 8, 37, 36)         0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 6, 35, 48)         15600
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 3, 18, 48)         0
_________________________________________________________________
activation_4 (Activation)    (None, 3, 18, 48)         0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 1, 16, 64)         27712
_________________________________________________________________
dropout_1 (Dropout)          (None, 1, 16, 64)         0
_________________________________________________________________
activation_5 (Activation)    (None, 1, 16, 64)         0
_________________________________________________________________
flatten_1 (Flatten)          (None, 1024)              0
_________________________________________________________________
dense_1 (Dense)              (None, 100)               102500
_________________________________________________________________
dense_2 (Dense)              (None, 50)                5050
_________________________________________________________________
dense_3 (Dense)              (None, 10)                510
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 11
=================================================================
Total params: 175,071
Trainable params: 175,071
Non-trainable params: 0
_________________________________________________________________


            Model(No Cropping)

202/201 [==============================] - 2326s - loss: 0.0182 - val_loss: 0.0105
Saved model to:  model_v6.h5
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
lambda_1 (Lambda)            (None, 160, 320, 3)       0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 156, 316, 3)       228
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 78, 158, 3)        0
_________________________________________________________________
activation_1 (Activation)    (None, 78, 158, 3)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 74, 154, 24)       1824
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 37, 77, 24)        0
_________________________________________________________________
activation_2 (Activation)    (None, 37, 77, 24)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 33, 73, 36)        21636
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 17, 37, 36)        0
_________________________________________________________________
activation_3 (Activation)    (None, 17, 37, 36)        0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 15, 35, 48)        15600
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 8, 18, 48)         0
_________________________________________________________________
activation_4 (Activation)    (None, 8, 18, 48)         0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 6, 16, 64)         27712
_________________________________________________________________
dropout_1 (Dropout)          (None, 6, 16, 64)         0
_________________________________________________________________
activation_5 (Activation)    (None, 6, 16, 64)         0
_________________________________________________________________
flatten_1 (Flatten)          (None, 6144)              0
_________________________________________________________________
dense_1 (Dense)              (None, 100)               614500
_________________________________________________________________
dense_2 (Dense)              (None, 50)                5050
_________________________________________________________________
dense_3 (Dense)              (None, 10)                510
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 11
=================================================================
Total params: 687,071
Trainable params: 687,071
Non-trainable params: 0
_________________________________________________________________

            Model(Cropping top 50 pixels)
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
cropping2d_1 (Cropping2D)    (None, 110, 320, 3)       0
_________________________________________________________________
lambda_1 (Lambda)            (None, 110, 320, 3)       0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 106, 316, 3)       228
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 53, 158, 3)        0
_________________________________________________________________
activation_1 (Activation)    (None, 53, 158, 3)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 49, 154, 24)       1824
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 25, 77, 24)        0
_________________________________________________________________
activation_2 (Activation)    (None, 25, 77, 24)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 21, 73, 36)        21636
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 11, 37, 36)        0
_________________________________________________________________
activation_3 (Activation)    (None, 11, 37, 36)        0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 35, 48)         25968
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 4, 18, 48)         0
_________________________________________________________________
activation_4 (Activation)    (None, 4, 18, 48)         0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 2, 16, 64)         27712
_________________________________________________________________
dropout_1 (Dropout)          (None, 2, 16, 64)         0
_________________________________________________________________
activation_5 (Activation)    (None, 2, 16, 64)         0
_________________________________________________________________
flatten_1 (Flatten)          (None, 2048)              0
_________________________________________________________________
dense_1 (Dense)              (None, 100)               204900
_________________________________________________________________
dense_2 (Dense)              (None, 50)                5050
_________________________________________________________________
dense_3 (Dense)              (None, 10)                510
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 11
=================================================================
Total params: 287,839
Trainable params: 287,839
Non-trainable params: 0
_________________________________________________________________

            Model(Cropping top 50 pixels)

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
cropping2d_1 (Cropping2D)    (None, 110, 320, 3)       0
_________________________________________________________________
lambda_1 (Lambda)            (None, 110, 320, 3)       0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 106, 316, 3)       228
_________________________________________________________________
dropout_1 (Dropout)          (None, 106, 316, 3)       0
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 53, 158, 3)        0
_________________________________________________________________
activation_1 (Activation)    (None, 53, 158, 3)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 49, 154, 24)       1824
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 25, 77, 24)        0
_________________________________________________________________
activation_2 (Activation)    (None, 25, 77, 24)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 21, 73, 36)        21636
_________________________________________________________________
dropout_2 (Dropout)          (None, 21, 73, 36)        0
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 11, 37, 36)        0
_________________________________________________________________
activation_3 (Activation)    (None, 11, 37, 36)        0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 35, 48)         25968
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 4, 18, 48)         0
_________________________________________________________________
activation_4 (Activation)    (None, 4, 18, 48)         0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 2, 16, 64)         27712
_________________________________________________________________
activation_5 (Activation)    (None, 2, 16, 64)         0
_________________________________________________________________
flatten_1 (Flatten)          (None, 2048)              0
_________________________________________________________________
dense_1 (Dense)              (None, 100)               204900
_________________________________________________________________
dense_2 (Dense)              (None, 50)                5050
_________________________________________________________________
dense_3 (Dense)              (None, 10)                510
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 11
=================================================================
Total params: 287,839
Trainable params: 287,839
Non-trainable params: 0
_________________________________________________________________